bench-results-ft-ep-native-20260722-113242/logs/bench-ft-a2av-single-decode-20260722-120327.log
Writing benchmark result to bench-results-ft-ep-native-20260722-113242/ft-a2av-single-decode-20260722-120856.json
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff8f18305e0>, trust_remote_code=False, seed=0, num_prompts=1024, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=256, model='deepseek-ai/DeepSeek-V2-Lite-Chat', input_len=128, output_len=1024, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=128, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['config=ft-a2av-single', 'workload=decode', 'tp=1', 'dp=8', 'model=deepseek-ai/DeepSeek-V2-Lite-Chat', 'dtype=bfloat16', 'max_model_len=4096', 'max_num_batched_tokens=4096', 'all2all_backend=ft_nccl_a2av'], result_dir='bench-results-ft-ep-native-20260722-113242', result_filename='ft-a2av-single-decode-20260722-120856.json', ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-cca70614-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=1800, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-22 12:09:06 [utils.py:90] Sampling input_len from [128, 128] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Waiting for endpoint to become up in 1800 seconds
 |          | 00:00 elapsed, 00:32 remainingWARNING 07-22 12:09:08 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:05 elapsed, 29:54 remainingWARNING 07-22 12:09:13 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:10 elapsed, 29:49 remainingWARNING 07-22 12:09:18 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:15 elapsed, 29:44 remainingWARNING 07-22 12:09:23 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:20 elapsed, 29:39 remainingWARNING 07-22 12:09:28 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:25 elapsed, 29:34 remainingWARNING 07-22 12:09:33 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:30 elapsed, 29:29 remainingWARNING 07-22 12:09:38 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:35 elapsed, 29:24 remainingWARNING 07-22 12:09:43 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:40 elapsed, 29:19 remainingWARNING 07-22 12:09:48 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 00:45 elapsed, 29:14 remainingWARNING 07-22 12:09:53 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 00:50 elapsed, 29:09 remainingWARNING 07-22 12:09:58 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 00:55 elapsed, 29:04 remainingWARNING 07-22 12:10:03 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 01:00 elapsed, 28:59 remainingWARNING 07-22 12:10:08 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 01:05 elapsed, 28:54 remainingWARNING 07-22 12:10:13 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:10 elapsed, 28:49 remainingWARNING 07-22 12:10:18 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:15 elapsed, 28:44 remainingWARNING 07-22 12:10:23 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:20 elapsed, 28:39 remainingWARNING 07-22 12:10:28 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:25 elapsed, 28:34 remainingWARNING 07-22 12:10:33 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:30 elapsed, 28:29 remainingWARNING 07-22 12:10:38 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:35 elapsed, 28:24 remainingWARNING 07-22 12:10:43 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:40 elapsed, 28:19 remainingWARNING 07-22 12:10:48 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:45 elapsed, 28:14 remainingWARNING 07-22 12:10:53 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:50 elapsed, 28:09 remainingWARNING 07-22 12:10:58 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▋         | 01:55 elapsed, 28:04 remainingWARNING 07-22 12:11:03 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▋         | 02:00 elapsed, 27:59 remainingWARNING 07-22 12:11:08 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▋         | 02:05 elapsed, 27:54 remainingWARNING 07-22 12:11:13 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▋         | 02:10 elapsed, 27:49 remainingWARNING 07-22 12:11:18 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▊         | 02:24 elapsed, 29:43 remaining
Initial test run completed.
Warming up with 128 requests...
100%|██████████| 128/128 [00:22<00:00,  5.75it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 256
100%|██████████| 1024/1024 [02:25<00:00,  7.02it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1024      
Failed requests:                         0         
Maximum request concurrency:             256       
Benchmark duration (s):                  145.96    
Total input tokens:                      131072    
Total generated tokens:                  1048576   
Request throughput (req/s):              7.02      
Output token throughput (tok/s):         7184.17   
Peak output token throughput (tok/s):    12032.00  
Peak concurrent requests:                512.00    
Total token throughput (tok/s):          8082.19   
---------------Time to First Token----------------
Mean TTFT (ms):                          1532.09   
Median TTFT (ms):                        1723.10   
P99 TTFT (ms):                           2314.96   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.16     
Median TPOT (ms):                        34.46     
P99 TPOT (ms):                           36.40     
---------------Inter-token Latency----------------
Mean ITL (ms):                           34.16     
Median ITL (ms):                         33.64     
P99 ITL (ms):                            48.18     
==================================================